# GetAllFabricationConfigurations Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfigurationInfo..::..GetAllFabricationConfigurations Method
FabricationConfigurationInfo Class See Also
---
Gets all added fabrication configurations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static IList<FabricationConfigurationInfo> GetAllFabricationConfigurations()
```

Visual Basic
---
```text
Public Shared Function GetAllFabricationConfigurations As IList(Of FabricationConfigurationInfo)
```

Visual C++
---
```text
public:
static IList<FabricationConfigurationInfo^>^ GetAllFabricationConfigurations()
```

# ### Return Value
All added fabrication configurations.
# See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace